<?php
/* ==========================================================
 * セーブデータ取得API
 * ----------------------------------------------------------
 * ・指定されたプレイヤーIDに紐づくプレイヤー情報とセーブデータを取得する。
 * ・取得結果が存在しない場合は空配列を返却。
 * ----------------------------------------------------------
 * 更新履歴：
 * 2025-11-12 作成
 * ========================================================== */

/* ==========================================================
 * 1. 共通モジュール読み込み
 * ========================================================== */
// 1.ヘッダ情報
require_once "../../Cors/Header.php";
// 2.接続設定
require_once "../../DB/DB.php";
// 3.ログ関数
require_once "../../Utility/LogWrite.php";

/* ==========================================================
 * 2. リクエストデータ取得
 * ========================================================== */
// 1.POSTデータを取得
$PostData = json_decode(file_get_contents("php://input"), true);
// 2.プレイヤーIDを取得
$PlayerId = $PostData["PlayerId"] ?? null;

/* ==========================================================
 * 3. セーブデータ取得処理
 * ========================================================== */
try {
    /* ------------------------------
     * SQL定義
     * ------------------------------ */
    $stmt = $pdo->prepare("SELECT 
                                t1.playername, 
                                t2.saveslotid,  
                                t2.storyid,  
                                t2.registdate,               
                                t2.updatedate    
                           FROM PlayerInfo t1
                           LEFT JOIN SaveInfo t2
                             ON  t1.playerid = t2.playerid
                           WHERE t1.playerid = :playerid
                           ORDER BY t2.saveslotid ASC
                         ");

    /* ------------------------------
     * パラメータ設定
     * ------------------------------ */
    // 1.プレイヤーID設定
    $stmt->bindValue(":playerid", $PlayerId, PDO::PARAM_STR);

    /* ------------------------------
     * SQL実行
     * ------------------------------ */
    // 1.SQL実行
    $stmt->execute();
    // 2.結果セットの読み取り
    $Rows = $stmt->fetchAll(PDO::FETCH_ASSOC);

    /* ------------------------------
     * レスポンス生成
     * ------------------------------ */
    if ($Rows) {
        // 1.結果セットが存在する場合のレスポンス
        echo json_encode([
            "success" => true,
            "message" => "セーブデータの取得に成功しました。",
            "items"   => $Rows
        ]);
    } else {
        // 2.結果セットが存在しない場合のレスポンス
        echo json_encode([
            "success" => true,
            "message" => "セーブデータが存在しません。",
            "items"   => []
        ]);
    }

/* ==========================================================
 * 4. 例外処理
 * ========================================================== */
} catch (PDOException $e) {
    // 1.ログ書き込み
    writeLog("セーブデータ取得エラー | error : " . $e->getMessage());
    // 2.レスポンスを返却
    echo json_encode([
        "success" => false,
        "message" => "DBエラーが発生しました。システム管理者にお問い合わせください。"
    ]);
}
